




const dependences = [



	// масиви-списки з інших сайтів ( сторонні ) ----------------------------------------------------------------------------------
	
	{ db: 'country' 	, site: 'db', },  // https://pillypenkosa.github.io/   ${ k.site }   /list/list.   ${ k.db }   .js





	// масиви-списки з ЦЬОГО проекту ( свої ) -------------------------------------------------------------------------------------

	{ arr: 'any' 			, },
	





	// компоненти загальні --------------------------------------------------------------------------------------------------------


	{ cmp: 'Win-Err404' 			, },
	{ cmp: 'Footer' 				, },
	{ cmp: 'Menu' 					, },
	{ cmp: 'Header' 				, },








	// компоненти-контенти // win-сторiнки ----------------------------------------------------------------------------------------
	
	{ cmp: 'Win-Index' 					, regexp: /^index$/ 					, }, 	// regexp - url-маршрут (route) в адресному рядку



	//{ cmp: 'Win-User' 			, regexp: /^user\/[0-9]+$/ 				, }, 	// user/{ n }
	//{ cmp: 'Win-User' 			, regexp: /^user\/[0-9A-Za-z]+$/ 		, }, 	// user/{ txt }
	//{ cmp: 'Win-Users' 			, regexp: /^users$/ 					, },










];




















